{
    "title": {
        "1": "Ministry Leadership",
        "2": "Interns Wanted",
        "3": "Medical Mission Trip"
    },
    "date": {
        "1": "12/14/24",
        "2": "05/17/2025",
        "3": "09/08/25"
    },
    "firstName": {
        "1": "Liam",
        "2": "David",
        "3": "Rachel"
    },
    "lastName": {
        "1": "Carter",
        "2": "Reynolds",
        "3": "Kelly"
    },
    "organization": {
        "1": "Oak Tree Church of Christ",
        "2": "Graceway Church of Christ ",
        "3": "Global Hope Missions"
    },
    "location": {
        "1": "Dallas, TX, USA",
        "2": "Springdale, Arkansas, USA",
        "3": "Eldoret, Kenya"
    },
    "tag1": {
        "1": "Preacher",
        "2": "Internship",
        "3": "healthcare missions"
    },
    "tag2": {
        "1": "Youth",
        "2": "Media/Technology",
        "3": "cross-cultural ministry"
    },
    "tag3": {
        "1": "Education",
        "2": "Unpaid",
        "3": "unpaid"
    },
    "tag4": {
        "1": "Leadership",
        "2": "Leadership",
        "3": "null"
    },
    "tag5": {
        "1": "Paid",
        "2": "Education",
        "3": "null"
    },
    "shortDescription": {
        "1": "Youth Ministry experience needed at Oak Tree Church of Christ!",
        "2": "Wanting two male interns for the summer.",
        "3": "Provide medical care and spiritual support to underserved communities in Kenya through a faith-based mission."
    },
    "position": {
        "1": "Ministry Leadership and Staff",
        "2": "Ministry Internship",
        "3": "Medical Personel"
    },
    "longDescription": {
        "1": "Our congregation is holding sessions for spirituality in different facets of life, and we are seeking someone knowledgeable in psychology and/or sociology for this job. There will be two days of sessions, and we would like anyone who has availability for these times. Thank you!",
        "2": "We are seeking two male interns for the summer to assist with various ministry efforts, including youth programs, community outreach, and church event planning. Interns will gain hands-on experience in church leadership, discipleship, and service while working closely with church staff and members. This is a great opportunity for young men looking to grow in faith and ministry experience.",
        "3": "This two-week medical mission trip to Eldoret, Kenya, offers healthcare professionals and volunteers the opportunity to serve in medical clinics while sharing the love of Christ. Participants will assist in providing basic medical care, health education, and community outreach programs. Daily devotions and evening worship sessions will foster a spiritually enriching environment for both team members and those they serve. No prior medical experience is required, though medical professionals are especially encouraged to join."
    }
}